api/app/models/user.rb

    def self.from_token_request request
        username = request.params["auth"] && request.params["auth"]["username"]
        self.find_by username: username
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "rob"], ["LIMIT", 1]]

      def to_token_payload
        user = User.find_by username: username
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "rob"], ["LIMIT", 1]]